# YOLOv11 optimized for Table Detection

nc: 1  # only 1 class: table

scales:
  s: [0.50, 1.00, 512]

# Backbone (phải có 10 layers)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 2, C3k2, [256, True, 0.25]]  # 2

  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 2, C3k2, [512, True, 0.25]]  # 4

  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 2, C3k2, [512, True]]     # 6

  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]    # 8

  - [-1, 1, SPPF, [1024, 5]]       # 9

# Head
head:
  # P5 → P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]      # 11
  - [-1, 2, C3k2, [512, False]]    # 12

  # P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]      # 14
  - [-1, 2, C3k2, [256, False]]    # 15

  # P3 down → P4
  - [-1, 1, Conv, [256, 3, 2]]     # 16
  - [[-1, 12], 1, Concat, [1]]     # 17
  - [-1, 2, C3k2, [512, False]]    # 18

  # P4 down → P5
  - [-1, 1, Conv, [512, 3, 2]]     # 19
  - [[-1, 9], 1, Concat, [1]]      # 20
  - [-1, 2, C3k2, [1024, False]]   # 21

  # Detect on P3, P4, P5
  - [[15, 18, 21], 1, Detect, [nc]]  # 22